<?php

use common\models\DetiAnket;
use yii\bootstrap4\ActiveForm;
use yii\bootstrap4\Html;

$this->title = 'Выгрузка данных в виде МАТРИЦЫ №5';

$itogArr = [];

$numStr = [
    ['7', 'Количество респондентов', 3],
    ['', 'из них, мальчиков (юношей)', 4],
    ['', 'девочек (девушек)', 5],
    ['8', 'Полнота семей', 6],
    ['', 'полная семья', 7],
    ['', 'не полная семья ', 8],
    ['', 'отказ от ответа+затрудняюсь', 9],
    ['9', 'ИМТ у ребенка', 41],
    ['', 'дефицит массы тела', 42],
    ['', 'нормальная масса тела', 43],
    ['', 'избыточная масса тела', 44],
    ['', 'ожирение', 45],
    ['', 'отказ от ответа+затрудняюсь', 46],
    ['11', 'ИМТ у матери', 47],
    ['', 'дефицит массы тела', 48],
    ['', 'нормальная масса тела', 49],
    ['', 'избыточная масса тела', 50],
    ['', 'ожирение', 51],
    ['', 'отказ от ответа+затрудняюсь', 52],
    ['11', 'ИМТ у отца', 53],
    ['', 'дефицит массы тела', 54],
    ['', 'нормальная масса тела', 55],
    ['', 'избыточная масса тела', 56],
    ['', 'ожирение', 57],
    ['', 'отказ от ответа+затрудняюсь', 58],
    ['12', 'Количество приемов пищи у ребенка в учебные дни', 98],
    ['', 'два и менее', 99],
    ['', 'три', 100],
    ['', 'четыре', 101],
    ['', 'пять и более', 102],
    ['', 'отказ от ответа+затрудняюсь', 103],
    ['13', 'Количество приемов пищи у ребенка в выходные дни', 104],
    ['', 'два и менее', 105],
    ['', 'три', 106],
    ['', 'четыре', 107],
    ['', 'пять и более', 108],
    ['', 'отказ от ответа+затрудняюсь', 109],
    ['14', 'Еда перед школой', 110],
    ['25.1.', 'всегда', 111],
    ['25.2.', 'не всегда', 112],
    ['25.3.', 'никогда', 113],
    ['25.4.', 'отказ от ответа+затрудняюсь', 114],
    ['26', 'Ест ли ребенок в школьной столовой', 115],
    ['26.1.', 'всегда', 116],
    ['26.2.', 'не всегда', 117],
    ['26.3.', 'никогда', 118],
    ['26.4.', 'отказ от ответа+затрудняюсь', 119],
    ['16', 'Частота потребления отдельных групп продуктов', 294],
    ['надо по этим детям и остальным сделать отдельную выборку', 'каши', 300],
    ['посмотреть заболеваемость', 'каждый день', 301],
    ['ожирение', '3-4 раза в неделю', 302],
    ['', '1 раз в неделю', 303],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 304],
    ['', 'не ест вообще', 305],
    ['', 'отказ от ответа+затрудняюсь', 306],
    ['b', 'макароны', 307],
    ['', 'каждый день', 308],
    ['', '3-4 раза в неделю', 309],
    ['', '1 раз в неделю', 310],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 311],
    ['', 'не ест вообще', 312],
    ['', 'отказ от ответа+затрудняюсь', 313],
    ['c', 'мясо', 314],
    ['', 'каждый день', 315],
    ['', '3-4 раза в неделю', 316],
    ['', '1 раз в неделю', 317],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 318],
    ['', 'не ест вообще', 319],
    ['', 'отказ от ответа+затрудняюсь', 320],
    ['d', 'мясо птицы', 321],
    ['', 'каждый день', 322],
    ['', '3-4 раза в неделю', 323],
    ['', '1 раз в неделю', 324],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 325],
    ['', 'не ест вообще', 326],
    ['', 'отказ от ответа+затрудняюсь', 327],
    ['e', 'жидкие молочные продукты', 328],
    ['', 'каждый день', 329],
    ['', '3-4 раза в неделю', 330],
    ['', '1 раз в неделю', 331],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 332],
    ['', 'не ест вообще', 333],
    ['', 'отказ от ответа+затрудняюсь', 334],
    ['f', 'творожные блюда', 335],
    ['', 'каждый день', 336],
    ['', '3-4 раза в неделю', 337],
    ['', '1 раз в неделю', 338],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 339],
    ['', 'не ест вообще', 340],
    ['', 'отказ от ответа+затрудняюсь', 341],
    ['g', 'творожные сырки и сладкие молочные десерты', 342],
    ['', 'каждый день', 343],
    ['', '3-4 раза в неделю', 344],
    ['', '1 раз в неделю', 345],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 346],
    ['', 'не ест вообще', 347],
    ['', 'отказ от ответа+затрудняюсь', 348],
    ['h', 'рыба', 349],
    ['', 'каждый день', 350],
    ['', '3-4 раза в неделю', 351],
    ['', '1 раз в неделю', 352],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 353],
    ['', 'не ест вообще', 354],
    ['', 'отказ от ответа+затрудняюсь', 355],
    ['i', 'овощи', 356],
    ['', 'каждый день', 357],
    ['', '3-4 раза в неделю', 358],
    ['', '1 раз в неделю', 359],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 360],
    ['', 'не ест вообще', 361],
    ['', 'отказ от ответа+затрудняюсь', 362],
    ['j', 'картофель', 363],
    ['', 'каждый день', 364],
    ['', '3-4 раза в неделю', 365],
    ['', '1 раз в неделю', 366],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 367],
    ['', 'не ест вообще', 368],
    ['', 'отказ от ответа+затрудняюсь', 369],
    ['k', 'фрукты', 370],
    ['', 'каждый день', 371],
    ['', '3-4 раза в неделю', 372],
    ['', '1 раз в неделю', 373],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 374],
    ['', 'не ест вообще', 375],
    ['', 'отказ от ответа+затрудняюсь', 376],
    ['l', 'колбаса, сосиски, сардельки', 377],
    ['', 'каждый день', 378],
    ['', '3-4 раза в неделю', 379],
    ['', '1 раз в неделю', 380],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 381],
    ['', 'не ест вообще', 382],
    ['', 'отказ от ответа+затрудняюсь', 383],
    ['m', 'яйца, блюда из яиц', 384],
    ['', 'каждый день', 385],
    ['', '3-4 раза в неделю', 386],
    ['', '1 раз в неделю', 387],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 388],
    ['', 'не ест вообще', 389],
    ['', 'отказ от ответа+затрудняюсь', 390],
    ['n', 'фаст-фуд', 391],
    ['', 'каждый день', 392],
    ['', '3-4 раза в неделю', 393],
    ['', '1 раз в неделю', 394],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 395],
    ['', 'не ест вообще', 396],
    ['', 'отказ от ответа+затрудняюсь', 397],
    ['o', 'чипсы, сухарики', 398],
    ['', 'каждый день', 399],
    ['', '3-4 раза в неделю', 400],
    ['', '1 раз в неделю', 401],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 402],
    ['', 'не ест вообще', 403],
    ['', 'отказ от ответа+затрудняюсь', 404],
    ['p', 'кетчуп', 405],
    ['', 'каждый день', 406],
    ['', '3-4 раза в неделю', 407],
    ['', '1 раз в неделю', 408],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 409],
    ['', 'не ест вообще', 410],
    ['', 'отказ от ответа+затрудняюсь', 411],
    ['q', 'майонез', 412],
    ['', 'каждый день', 413],
    ['', '3-4 раза в неделю', 414],
    ['', '1 раз в неделю', 415],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 416],
    ['', 'не ест вообще', 417],
    ['', 'отказ от ответа+затрудняюсь', 418],
    ['r', 'сдобная выпечка', 419],
    ['', 'каждый день', 420],
    ['', '3-4 раза в неделю', 421],
    ['', '1 раз в неделю', 422],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 423],
    ['', 'не ест вообще', 424],
    ['', 'отказ от ответа+затрудняюсь', 425],
    ['s', 'торты и пирожные', 426],
    ['', 'каждый день', 427],
    ['', '3-4 раза в неделю', 428],
    ['', '1 раз в неделю', 429],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 430],
    ['', 'не ест вообще', 431],
    ['', 'отказ от ответа+затрудняюсь', 432],
    ['t', 'шоколад и конфеты', 433],
    ['', 'каждый день', 434],
    ['', '3-4 раза в неделю', 435],
    ['', '1 раз в неделю', 436],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 437],
    ['', 'не ест вообще', 438],
    ['', 'отказ от ответа+затрудняюсь', 439],
    ['u', 'карамель, зефир, пастила', 440],
    ['', 'каждый день', 441],
    ['', '3-4 раза в неделю', 442],
    ['', '1 раз в неделю', 443],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 444],
    ['', 'не ест вообще', 445],
    ['', 'отказ от ответа+затрудняюсь', 446],
    ['v', 'сладкие газированые напитки', 447],
    ['', 'каждый день', 448],
    ['', '3-4 раза в неделю', 449],
    ['', '1 раз в неделю', 450],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 451],
    ['', 'не ест вообще', 452],
    ['', 'отказ от ответа+затрудняюсь', 453],
    ['w', 'соки фруктовые', 454],
    ['', 'каждый день', 455],
    ['', '3-4 раза в неделю', 456],
    ['', '1 раз в неделю', 457],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 458],
    ['', 'не ест вообще', 459],
    ['', 'отказ от ответа+затрудняюсь', 460],
    ['x', 'напитки с добавлением сахара', 461],
    ['', 'каждый день', 462],
    ['', '3-4 раза в неделю', 463],
    ['', '1 раз в неделю', 464],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 465],
    ['', 'не ест вообще', 466],
    ['', 'отказ от ответа+затрудняюсь', 467],
    ['y', 'питьевая вода ', 468],
    ['', 'каждый день', 469],
    ['', '3-4 раза в неделю', 470],
    ['', '1 раз в неделю', 471],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 472],
    ['', 'не ест вообще', 473],
    ['', 'отказ от ответа+затрудняюсь', 474],
    ['z', 'привычное количество чайных ложек сахара вносимых в чашку с горячим напитком', 475],
    ['', '0', 476],
    ['', 'от 1 до 2', 477],
    ['', '3 и более', 478],
    ['aa', 'имеется ли привычка досаливать блюда', 479],
    ['', 'да ', 480],
    ['', 'нет', 481],
    ['17', 'Чем ребенок перекусывать вне дома и вне школы (учитывается только ДА)', 482],
    ['надо по этим детям и остальным сделать отдельную выборку', 'Фаст-фуд', 483],
    ['посмотреть заболеваемость', 'Чипсы', 484],
    ['ожирение', 'Шоколад, конфеты', 485],
    ['', 'Пирожные', 486],
    ['', 'Булочки, пироги', 487],
    ['', 'Пряники, печенье', 488],
    ['', 'Зефир, мармелад', 489],
    ['', 'Мороженое', 490],
    ['', 'Соки, нектары', 491],
    ['', 'Вода питьевая бутилированная', 492],
    ['', 'Сладкие газированные напитки', 493],
    ['', 'отказ от ответа+затрудняюсь (максимум)', 494],
    ['18', 'Улучшилось ли питание в сравнении с прошлым годом в соотвествии с принципами здорового питания ', 495],
    ['', 'в школе', 496],
    ['', 'стало лучше', 497],
    ['', 'не изменилось', 498],
    ['', 'стало хуже', 499],
    ['', 'отказ от ответа+затрудняюсь (максимум)', 500],
    ['', 'дома', 501],
    ['', 'стало лучше', 502],
    ['', 'не изменилось', 503],
    ['', 'стало хуже', 504],
    ['', 'отказ от ответа+затрудняюсь (максимум)', 505],
    ['19', 'Нуждается ли в дальнейшем внесение изменений в структуру школьного питания', 517],
    ['', 'нет', 518],
    ['', 'да (общее количество детей)', 519],
    ['19.1.', 'Обеспечить возможность питания детей по вегетарианскому меню ', 520],
    ['19.2.', 'Обеспечить возможность выбора детьми вариантов меню или отдельных блюд в ОСНОВНОМ ПИТАНИИ', 521],
    ['19.3.', 'Ввести в старших классах возможность питания по типу «ШВЕДСКОГО СТОЛА»', 522],
    ['19.4.', 'Предоставить детям возможность приобретения горячих блюд в дополнительном питании ', 523],
    ['19.5.', 'Исключить из ассортимента дополнительного питания шоколад и кондитерские изделия промышленного изготовления', 524],
    ['19.6.', 'Введение второго завтрака для детей 1-4 классов с выдачей им ежедневно молока', 525],
    ['19.7.', 'Добавить в меню напитки без сахара', 526],
    ['19.8.', 'Увеличить продолжительность перемен для приема пищи – не менее 30 минут', 527],
    ['19.9.', 'Удобный режим работы столовой (или) буфета – не менее чем до 17 часов, когда дети могут получить питание', 528],
    ['19.10.', 'Иное', 529],
];
$numStr2 = [

    ['', '<b>ИМТ у матери</b>', 47],
    ['', 'дефицит массы тела', 48],
    ['', 'нормальная масса тела', 49],
    ['', 'избыточная масса тела', 50],
    ['', 'ожирение', 51],
    ['', 'отказ от ответа+затрудняюсь', 52],
    ['', '<b>ИМТ у отца</b>', 53],
    ['', 'дефицит массы тела', 54],
    ['', 'нормальная масса тела', 55],
    ['', 'избыточная масса тела', 56],
    ['', 'ожирение', 57],
    ['', 'отказ от ответа+затрудняюсь', 58],

    ['47', 'Критическая частота потребления отдельных групп продуктов', 294],
    ['a', '<b>каши</b>', 300],
    ['', 'каждый день', 301],
    ['', '3-4 раза в неделю', 302],
    ['', '1 раз в неделю', 303],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 304],
    ['', 'не ест вообще', 305],
    ['', 'отказ от ответа+затрудняюсь', 306],
    ['b', '<b>макароны</b>', 307],
    ['', 'каждый день', 308],
    ['', '3-4 раза в неделю', 309],
    ['', '1 раз в неделю', 310],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 311],
    ['', 'не ест вообще', 312],
    ['', 'отказ от ответа+затрудняюсь', 313],
    ['c', '<b>мясо</b>', 314],
    ['', 'каждый день', 315],
    ['', '3-4 раза в неделю', 316],
    ['', '1 раз в неделю', 317],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 318],
    ['', 'не ест вообще', 319],
    ['', 'отказ от ответа+затрудняюсь', 320],
    ['d', '<b>мясо птицы</b>', 321],
    ['', 'каждый день', 322],
    ['', '3-4 раза в неделю', 323],
    ['', '1 раз в неделю', 324],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 325],
    ['', 'не ест вообще', 326],
    ['', 'отказ от ответа+затрудняюсь', 327],
    ['e', '<b>жидкие молочные продукты</b>', 328],
    ['', 'каждый день', 329],
    ['', '3-4 раза в неделю', 330],
    ['', '1 раз в неделю', 331],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 332],
    ['', 'не ест вообще', 333],
    ['', 'отказ от ответа+затрудняюсь', 334],
    ['f', '<b>творожные блюда</b>', 335],
    ['', 'каждый день', 336],
    ['', '3-4 раза в неделю', 337],
    ['', '1 раз в неделю', 338],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 339],
    ['', 'не ест вообще', 340],
    ['', 'отказ от ответа+затрудняюсь', 341],
    ['g', '<b>творожные сырки и сладкие молочные десерты</b>', 342],
    ['', 'каждый день', 343],
    ['', '3-4 раза в неделю', 344],
    ['', '1 раз в неделю', 345],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 346],
    ['', 'не ест вообще', 347],
    ['', 'отказ от ответа+затрудняюсь', 348],
    ['h', '<b>рыба</b>', 349],
    ['', 'каждый день', 350],
    ['', '3-4 раза в неделю', 351],
    ['', '1 раз в неделю', 352],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 353],
    ['', 'не ест вообще', 354],
    ['', 'отказ от ответа+затрудняюсь', 355],
    ['i', '<b>овощи</b>', 356],
    ['', 'каждый день', 357],
    ['', '3-4 раза в неделю', 358],
    ['', '1 раз в неделю', 359],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 360],
    ['', 'не ест вообще', 361],
    ['', 'отказ от ответа+затрудняюсь', 362],
    ['j', '<b>картофель</b>', 363],
    ['', 'каждый день', 364],
    ['', '3-4 раза в неделю', 365],
    ['', '1 раз в неделю', 366],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 367],
    ['', 'не ест вообще', 368],
    ['', 'отказ от ответа+затрудняюсь', 369],
    ['k', '<b>фрукты</b>', 370],
    ['', 'каждый день', 371],
    ['', '3-4 раза в неделю', 372],
    ['', '1 раз в неделю', 373],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 374],
    ['', 'не ест вообще', 375],
    ['', 'отказ от ответа+затрудняюсь', 376],
    ['l', '<b>колбаса, сосиски, сардельки</b>', 377],
    ['', 'каждый день', 378],
    ['', '3-4 раза в неделю', 379],
    ['', '1 раз в неделю', 380],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 381],
    ['', 'не ест вообще', 382],
    ['', 'отказ от ответа+затрудняюсь', 383],
    ['m', '<b>яйца, блюда из яиц</b>', 384],
    ['', 'каждый день', 385],
    ['', '3-4 раза в неделю', 386],
    ['', '1 раз в неделю', 387],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 388],
    ['', 'не ест вообще', 389],
    ['', 'отказ от ответа+затрудняюсь', 390],
    ['n', '<b>фаст-фуд</b>', 391],
    ['', 'каждый день', 392],
    ['', '3-4 раза в неделю', 393],
    ['', '1 раз в неделю', 394],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 395],
    ['', 'не ест вообще', 396],
    ['', 'отказ от ответа+затрудняюсь', 397],
    ['o', '<b>чипсы, сухарики</b>', 398],
    ['', 'каждый день', 399],
    ['', '3-4 раза в неделю', 400],
    ['', '1 раз в неделю', 401],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 402],
    ['', 'не ест вообще', 403],
    ['', 'отказ от ответа+затрудняюсь', 404],
    ['p', '<b>кетчуп</b>', 405],
    ['', 'каждый день', 406],
    ['', '3-4 раза в неделю', 407],
    ['', '1 раз в неделю', 408],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 409],
    ['', 'не ест вообще', 410],
    ['', 'отказ от ответа+затрудняюсь', 411],
    ['q', '<b>майонез</b>', 412],
    ['', 'каждый день', 413],
    ['', '3-4 раза в неделю', 414],
    ['', '1 раз в неделю', 415],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 416],
    ['', 'не ест вообще', 417],
    ['', 'отказ от ответа+затрудняюсь', 418],
    ['r', '<b>сдобная выпечка</b>', 419],
    ['', 'каждый день', 420],
    ['', '3-4 раза в неделю', 421],
    ['', '1 раз в неделю', 422],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 423],
    ['', 'не ест вообще', 424],
    ['', 'отказ от ответа+затрудняюсь', 425],
    ['s', '<b>торты и пирожные</b>', 426],
    ['', 'каждый день', 427],
    ['', '3-4 раза в неделю', 428],
    ['', '1 раз в неделю', 429],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 430],
    ['', 'не ест вообще', 431],
    ['', 'отказ от ответа+затрудняюсь', 432],
    ['t', '<b>шоколад и конфеты</b>', 433],
    ['', 'каждый день', 434],
    ['', '3-4 раза в неделю', 435],
    ['', '1 раз в неделю', 436],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 437],
    ['', 'не ест вообще', 438],
    ['', 'отказ от ответа+затрудняюсь', 439],
    ['u', '<b>карамель, зефир, пастила</b>', 440],
    ['', 'каждый день', 441],
    ['', '3-4 раза в неделю', 442],
    ['', '1 раз в неделю', 443],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 444],
    ['', 'не ест вообще', 445],
    ['', 'отказ от ответа+затрудняюсь', 446],
    ['v', '<b>сладкие газированые напитки</b>', 447],
    ['', 'каждый день', 448],
    ['', '3-4 раза в неделю', 449],
    ['', '1 раз в неделю', 450],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 451],
    ['', 'не ест вообще', 452],
    ['', 'отказ от ответа+затрудняюсь', 453],
    ['w', '<b>соки фруктовые</b>', 454],
    ['', 'каждый день', 455],
    ['', '3-4 раза в неделю', 456],
    ['', '1 раз в неделю', 457],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 458],
    ['', 'не ест вообще', 459],
    ['', 'отказ от ответа+затрудняюсь', 460],
    ['x', '<b>напитки с добавлением сахара</b>', 461],
    ['', 'каждый день', 462],
    ['', '3-4 раза в неделю', 463],
    ['', '1 раз в неделю', 464],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 465],
    ['', 'не ест вообще', 466],
    ['', 'отказ от ответа+затрудняюсь', 467],
    ['y', '<b>питьевая вода</b>', 468],
    ['', 'каждый день', 469],
    ['', '3-4 раза в неделю', 470],
    ['', '1 раз в неделю', 471],
    ['', 'реже 1 раза в неделю (сумма 2-3 раза в месяц и 1 раз в месяц)', 472],
    ['', 'не ест вообще', 473],
    ['', 'отказ от ответа+затрудняюсь', 474],
    ['', '<b>привычное количество чайных ложек сахара вносимых в чашку с горячим напитком</b>', 475],
    ['', '0', 476],
    ['', 'от 1 до 2', 477],
    ['', '3 и более', 478],
    ['', '<b>имеется ли привычка досаливать блюда</b>', 479],
    ['', 'да ', 480],
    ['', 'нет', 481],


    ['', '<b>Чем ребенок перекусывать вне дома и вне школы (учитывается только ДА)</b>', 482],
    ['', 'Фаст-фуд', 483],
    ['', 'Чипсы', 484],
    ['', 'Шоколад, конфеты', 485],
    ['', 'Пирожные', 486],
    ['', 'Булочки, пироги', 487],
    ['', 'Пряники, печенье', 488],
    ['', 'Зефир, мармелад', 489],
    ['', 'Мороженое', 490],
    ['', 'Соки, нектары', 491],
    ['', 'Вода питьевая бутилированная', 492],
    ['', 'Сладкие газированные напитки', 493],
    ['', 'отказ от ответа+затрудняюсь (максимум)', 494],

];

?>
<div class="list-patients-report-form container">
    <?php
    $form = ActiveForm::begin();
    ?>
    <?=
    $this->render(
        '/report/_title-report',
        [
            'form' => $form,
            'modelReport' => $modelReport,

            'district_items' => $district_items,
            'region_items' => $region_items,
            'municipality_items' => $municipality_items,
            'org_items' => $org_items,

            'hasAccessFederalDistrict' => $hasAccessFederalDistrict,
            'hasAccessRegion' => $hasAccessRegion,
            'hasAccessMunicipality' => $hasAccessMunicipality,
            'hasAccessOrg' => $hasAccessOrg,
            'hasAccessTerrain' => $hasAccessTerrain,
            'hasAccessTypeSchool' => $hasAccessTypeSchool,
            'hasAccessSex' => $hasAccessSex,
            'hasAccessClass' => $hasAccessClass,
            'hasAccessShow' => $hasAccessShow,
            'hasAccessYear' => false,
        ]
    ); ?>
    <div class="form-group row">
        <?= Html::submitButton('Показать', ['class' => 'btn btn-success main-color form-control col-12 mt-3']) ?>
    </div>
    <?php
    ActiveForm::end(); ?>

</div>
<?
if ($result) { ?>
    <div class="container">
        <h5>Количество посчитанных анкет: <?=$resultAnketCount['countAnket']?></h5>
        <h5>Количество НЕ учтенных анкет: <?=$resultAnketCount['countUnaccountedFor']?></h5>
        <input type="button" class="btn btn-warning btn-block table2excel mb-3 mt-3"
               title="Вы можете скачать в формате Excel" value="Скачать в Excel" id="pechat222">
    </div>
    <h4 class="text-center">Выгрузка данных по анкетам для родителей и детей</h4>
    <div class="table-responsive">
        <table id="tableId2" class="table table-bordered table-sm table2excel_with_colors">
            <tr class="text-center">
                <th rowspan="3" colspan="2">Показатели</th>
                <th colspan="8" class="bg-info">Количество респондентов</th>
                <th colspan="8" >Количество респондентов</th>
                <th colspan="8" class="bg-info">Количество респондентов</th>
            </tr>
            <tr class="text-center">
                <th colspan="8" class="bg-info">городская местность </th>
                <th colspan="8" >сельская местность</th>
                <th colspan="8" class="bg-info">Общее количество (город+село)</th>
            </tr>
            <tr class="text-center">
                <th class="bg-info">всего</th>
                <th class="bg-info">2 класс</th>
                <th class="bg-info">3 класс</th>
                <th class="bg-info">5 класс</th>
                <th class="bg-info">6 класс</th>
                <th class="bg-info">10 класс</th>
                <th class="bg-info">11 класс</th>
                <th class="bg-info">иные (всего по анкетам 3 и 4)</th>

                <th>всего</th>
                <th>2 класс</th>
                <th>3 класс</th>
                <th>5 класс</th>
                <th>6 класс</th>
                <th>10 класс</th>
                <th>11 класс</th>
                <th>иные (всего по анкетам 3 и 4)</th>

                <th class="bg-info">всего</th>
                <th class="bg-info">2 класс</th>
                <th class="bg-info">3 класс</th>
                <th class="bg-info">5 класс</th>
                <th class="bg-info">6 класс</th>
                <th class="bg-info">10 класс</th>
                <th class="bg-info">11 класс</th>
                <th class="bg-info">иные (всего по анкетам 3 и 4)</th>
            </tr>
            <?
            for($i = 0; $i < count($numStr); $i++){?>
                <tr>
                    <td><?=$numStr[$i][2]?></td>
                    <td><?=$numStr[$i][1]?></td>
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table1']['city']['2'][$numStr[$i][2]]) ||
                            isset($result['table1']['city']['3'][$numStr[$i][2]]) ||
                            isset($result['table1']['city']['5'][$numStr[$i][2]]) ||
                            isset($result['table1']['city']['6'][$numStr[$i][2]]) ||
                            isset($result['table1']['city']['10'][$numStr[$i][2]]) ||
                            isset($result['table1']['city']['11'][$numStr[$i][2]]) ||
                            isset($result['table1']['city']['ini'][$numStr[$i][2]])||
                            isset($result['table1']['city']['ini_v2'][$numStr[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table1']['city']['2'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['3'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['5'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['6'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['10'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['11'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['ini'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['ini_v2'][$numStr[$i][2]]
                            ;
                            echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table1']['city']['2'][$numStr[$i][2]]))
                        { echo $result['table1']['city']['2'][$numStr[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table1']['city']['3'][$numStr[$i][2]]))
                        { echo $result['table1']['city']['3'][$numStr[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table1']['city']['5'][$numStr[$i][2]]))
                        { echo $result['table1']['city']['5'][$numStr[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table1']['city']['6'][$numStr[$i][2]]))
                        { echo $result['table1']['city']['6'][$numStr[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table1']['city']['10'][$numStr[$i][2]]))
                        { echo $result['table1']['city']['10'][$numStr[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table1']['city']['11'][$numStr[$i][2]]))
                        { echo $result['table1']['city']['11'][$numStr[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info">
                        <?if(
                            isset($result['table1']['city']['ini'][$numStr[$i][2]])||
                            isset($result['table1']['city']['ini_v2'][$numStr[$i][2]])
                        )
                        {
                            $sum_city_ini =
                                (int)$result['table1']['city']['ini'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['ini_v2'][$numStr[$i][2]]
                            ;
                            echo $sum_city_ini;
                        } else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(
                            isset($result['table1']['village']['2'][$numStr[$i][2]]) ||
                            isset($result['table1']['village']['3'][$numStr[$i][2]]) ||
                            isset($result['table1']['village']['5'][$numStr[$i][2]]) ||
                            isset($result['table1']['village']['6'][$numStr[$i][2]]) ||
                            isset($result['table1']['village']['10'][$numStr[$i][2]]) ||
                            isset($result['table1']['village']['11'][$numStr[$i][2]]) ||
                            isset($result['table1']['village']['ini'][$numStr[$i][2]])||
                            isset($result['table1']['village']['ini_v2'][$numStr[$i][2]])
                        )
                        {
                            $sum_village =
                                (int)$result['table1']['village']['2'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['3'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['5'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['6'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['10'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['11'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['ini'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['ini_v2'][$numStr[$i][2]]
                            ;
                            echo $sum_village;
                        } else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table1']['village']['2'][$numStr[$i][2]]))
                        { echo $result['table1']['village']['2'][$numStr[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table1']['village']['3'][$numStr[$i][2]]))
                        { echo $result['table1']['village']['3'][$numStr[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table1']['village']['5'][$numStr[$i][2]]))
                        { echo $result['table1']['village']['5'][$numStr[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table1']['village']['6'][$numStr[$i][2]]))
                        { echo $result['table1']['village']['6'][$numStr[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table1']['village']['10'][$numStr[$i][2]]))
                        { echo $result['table1']['village']['10'][$numStr[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table1']['village']['11'][$numStr[$i][2]]))
                        { echo $result['table1']['village']['11'][$numStr[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center">
                        <?if(
                            isset($result['table1']['village']['ini'][$numStr[$i][2]])||
                            isset($result['table1']['village']['ini_v2'][$numStr[$i][2]])
                        )
                        {
                            $sum_city_ini =
                                (int)$result['table1']['village']['ini'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['ini_v2'][$numStr[$i][2]]
                            ;
                            echo $sum_city_ini;
                        } else echo 0;?>
                    </td>

                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table1']['village']['2'][$numStr[$i][2]]) ||
                            isset($result['table1']['village']['3'][$numStr[$i][2]]) ||
                            isset($result['table1']['village']['5'][$numStr[$i][2]]) ||
                            isset($result['table1']['village']['6'][$numStr[$i][2]]) ||
                            isset($result['table1']['village']['10'][$numStr[$i][2]]) ||
                            isset($result['table1']['village']['11'][$numStr[$i][2]]) ||
                            isset($result['table1']['village']['ini'][$numStr[$i][2]])||
                            isset($result['table1']['village']['ini_v2'][$numStr[$i][2]])||
                            isset($result['table1']['city']['2'][$numStr[$i][2]]) ||
                            isset($result['table1']['city']['3'][$numStr[$i][2]]) ||
                            isset($result['table1']['city']['5'][$numStr[$i][2]]) ||
                            isset($result['table1']['city']['6'][$numStr[$i][2]]) ||
                            isset($result['table1']['city']['10'][$numStr[$i][2]]) ||
                            isset($result['table1']['city']['11'][$numStr[$i][2]]) ||
                            isset($result['table1']['city']['ini'][$numStr[$i][2]])||
                            isset($result['table1']['city']['ini_v2'][$numStr[$i][2]])
                        )
                        {
                            $sum_itog =
                                (int)$result['table1']['village']['2'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['3'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['5'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['6'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['10'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['11'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['ini'][$numStr[$i][2]] +
                                (int)$result['table1']['village']['ini_v2'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['2'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['3'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['5'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['6'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['10'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['11'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['ini'][$numStr[$i][2]] +
                                (int)$result['table1']['city']['ini_v2'][$numStr[$i][2]]
                            ; echo $sum_itog;
                        } else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table1']['village']['2'][$numStr[$i][2]])||
                            isset($result['table1']['city']['2'][$numStr[$i][2]])
                        )
                        { echo ($result['table1']['village']['2'][$numStr[$i][2]] + $result['table1']['city']['2'][$numStr[$i][2]]);} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table1']['village']['3'][$numStr[$i][2]])||
                            isset($result['table1']['city']['3'][$numStr[$i][2]])
                        )
                        { echo ($result['table1']['village']['3'][$numStr[$i][2]] + $result['table1']['city']['3'][$numStr[$i][2]]);} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table1']['village']['5'][$numStr[$i][2]])||
                            isset($result['table1']['city']['5'][$numStr[$i][2]])
                        )
                        { echo ($result['table1']['village']['5'][$numStr[$i][2]] + $result['table1']['city']['5'][$numStr[$i][2]]);} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table1']['village']['6'][$numStr[$i][2]])||
                            isset($result['table1']['city']['6'][$numStr[$i][2]])
                        )
                        { echo ($result['table1']['village']['6'][$numStr[$i][2]] + $result['table1']['city']['6'][$numStr[$i][2]]);} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table1']['village']['10'][$numStr[$i][2]])||
                            isset($result['table1']['city']['10'][$numStr[$i][2]])
                        )
                        { echo ($result['table1']['village']['10'][$numStr[$i][2]] + $result['table1']['city']['10'][$numStr[$i][2]]);} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table1']['village']['11'][$numStr[$i][2]])||
                            isset($result['table1']['city']['11'][$numStr[$i][2]])
                        )
                        { echo ($result['table1']['village']['11'][$numStr[$i][2]] + $result['table1']['city']['11'][$numStr[$i][2]]);} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table1']['village']['ini'][$numStr[$i][2]])||
                            isset($result['table1']['village']['ini_v2'][$numStr[$i][2]])||
                            isset($result['table1']['city']['ini'][$numStr[$i][2]])||
                            isset($result['table1']['city']['ini_v2'][$numStr[$i][2]])
                        )
                        { echo (
                            $result['table1']['village']['ini'][$numStr[$i][2]] +
                            $result['table1']['village']['ini_v2'][$numStr[$i][2]] +
                            $result['table1']['city']['ini'][$numStr[$i][2]] +
                            $result['table1']['city']['ini_v2'][$numStr[$i][2]]
                        );} else echo 0;?>
                    </td>
                </tr>
                <?
            }?>
            <tr>
                <td colspan="17"></td>
            </tr>
            <tr>
                <th class="text-center" rowspan="4" colspan="2">Показатели</th>
                <th class="text-center text-danger" rowspan="3" colspan="3">Количество респондентов с ИМТ анкета 3 и анкета 4</th>
                <th class="text-center" colspan="32">Все (мальчики и девочки) анкета 3 и анкета 4</th>
                <th class="text-center bg-info" colspan="32">Мальчики анкета 3 и анкета 4</th>
                <th class="text-center" colspan="32">Девочки анкета 3 и анкета 4</th>
            </tr>
            <tr>
                <th class="text-center" colspan="8">Количество респондентов анкета 3 и анкета 4</th>
                <th class="text-center" colspan="8">Количество респондентов анкета 3 и анкета 4</th>
                <th class="text-center" colspan="8">Количество респондентов анкета 3 и анкета 4</th>
                <th class="text-center" colspan="8">Количество респондентов анкета 3 и анкета 4</th>

                <th class="text-center bg-info" colspan="8">Количество респондентов анкета 3 и анкета 4</th>
                <th class="text-center bg-info" colspan="8">Количество респондентов анкета 3 и анкета 4</th>
                <th class="text-center bg-info" colspan="8">Количество респондентов анкета 3 и анкета 4</th>
                <th class="text-center bg-info" colspan="8">Количество респондентов анкета 3 и анкета 4</th>

                <th class="text-center" colspan="8">Количество респондентов анкета 3 и анкета 4</th>
                <th class="text-center" colspan="8">Количество респондентов анкета 3 и анкета 4</th>
                <th class="text-center" colspan="8">Количество респондентов анкета 3 и анкета 4</th>
                <th class="text-center" colspan="8">Количество респондентов анкета 3 и анкета 4</th>
            </tr>
            <tr>
                <th class="text-center" colspan="8">ожирение</th>
                <th class="text-center" colspan="8">избыточная масса тела</th>
                <th class="text-center" colspan="8">нормальная масса тела</th>
                <th class="text-center" colspan="8">дефицит массы тела</th>

                <th class="text-center bg-info" colspan="8">ожирение</th>
                <th class="text-center bg-info" colspan="8">избыточная масса тела</th>
                <th class="text-center bg-info" colspan="8">нормальная масса тела</th>
                <th class="text-center bg-info" colspan="8">дефицит массы тела</th>

                <th class="text-center" colspan="8">ожирение</th>
                <th class="text-center" colspan="8">избыточная масса тела</th>
                <th class="text-center" colspan="8">нормальная масса тела</th>
                <th class="text-center" colspan="8">дефицит массы тела</th>
            </tr>
            <tr>
                <th class="text-center text-danger">Все</th>
                <th class="text-center text-danger">мальчики</th>
                <th class="text-center text-danger">девочки</th>

                <th class="text-center">всего</th>
                <th class="text-center">2 класс</th>
                <th class="text-center">3 класс</th>
                <th class="text-center">5 класс</th>
                <th class="text-center">6 класс</th>
                <th class="text-center">10 класс</th>
                <th class="text-center">11 класс</th>
                <th class="text-center">иные</th>

                <th class="text-center">всего</th>
                <th class="text-center">2 класс</th>
                <th class="text-center">3 класс</th>
                <th class="text-center">5 класс</th>
                <th class="text-center">6 класс</th>
                <th class="text-center">10 класс</th>
                <th class="text-center">11 класс</th>
                <th class="text-center">иные</th>

                <th class="text-center">всего</th>
                <th class="text-center">2 класс</th>
                <th class="text-center">3 класс</th>
                <th class="text-center">5 класс</th>
                <th class="text-center">6 класс</th>
                <th class="text-center">10 класс</th>
                <th class="text-center">11 класс</th>
                <th class="text-center">иные</th>

                <th class="text-center">всего</th>
                <th class="text-center">2 класс</th>
                <th class="text-center">3 класс</th>
                <th class="text-center">5 класс</th>
                <th class="text-center">6 класс</th>
                <th class="text-center">10 класс</th>
                <th class="text-center">11 класс</th>
                <th class="text-center">иные</th>

                <th class="text-center bg-info">всего</th>
                <th class="text-center bg-info">2 класс</th>
                <th class="text-center bg-info">3 класс</th>
                <th class="text-center bg-info">5 класс</th>
                <th class="text-center bg-info">6 класс</th>
                <th class="text-center bg-info">10 класс</th>
                <th class="text-center bg-info">11 класс</th>
                <th class="text-center bg-info">иные</th>

                <th class="text-center bg-info">всего</th>
                <th class="text-center bg-info">2 класс</th>
                <th class="text-center bg-info">3 класс</th>
                <th class="text-center bg-info">5 класс</th>
                <th class="text-center bg-info">6 класс</th>
                <th class="text-center bg-info">10 класс</th>
                <th class="text-center bg-info">11 класс</th>
                <th class="text-center bg-info">иные</th>

                <th class="text-center bg-info">всего</th>
                <th class="text-center bg-info">2 класс</th>
                <th class="text-center bg-info">3 класс</th>
                <th class="text-center bg-info">5 класс</th>
                <th class="text-center bg-info">6 класс</th>
                <th class="text-center bg-info">10 класс</th>
                <th class="text-center bg-info">11 класс</th>
                <th class="text-center bg-info">иные</th>

                <th class="text-center bg-info">всего</th>
                <th class="text-center bg-info">2 класс</th>
                <th class="text-center bg-info">3 класс</th>
                <th class="text-center bg-info">5 класс</th>
                <th class="text-center bg-info">6 класс</th>
                <th class="text-center bg-info">10 класс</th>
                <th class="text-center bg-info">11 класс</th>
                <th class="text-center bg-info">иные</th>

                <th class="text-center">всего</th>
                <th class="text-center">2 класс</th>
                <th class="text-center">3 класс</th>
                <th class="text-center">5 класс</th>
                <th class="text-center">6 класс</th>
                <th class="text-center">10 класс</th>
                <th class="text-center">11 класс</th>
                <th class="text-center">иные</th>

                <th class="text-center">всего</th>
                <th class="text-center">2 класс</th>
                <th class="text-center">3 класс</th>
                <th class="text-center">5 класс</th>
                <th class="text-center">6 класс</th>
                <th class="text-center">10 класс</th>
                <th class="text-center">11 класс</th>
                <th class="text-center">иные</th>

                <th class="text-center">всего</th>
                <th class="text-center">2 класс</th>
                <th class="text-center">3 класс</th>
                <th class="text-center">5 класс</th>
                <th class="text-center">6 класс</th>
                <th class="text-center">10 класс</th>
                <th class="text-center">11 класс</th>
                <th class="text-center">иные</th>

                <th class="text-center">всего</th>
                <th class="text-center">2 класс</th>
                <th class="text-center">3 класс</th>
                <th class="text-center">5 класс</th>
                <th class="text-center">6 класс</th>
                <th class="text-center">10 класс</th>
                <th class="text-center">11 класс</th>
                <th class="text-center">иные</th>
            </tr>
            <?
            for($i = 0; $i < count($numStr2); $i++){?>
                <tr>
                    <td><?=$i?></td>
                    <td><?=$numStr2[$i][1]?></td>
                    <td class="text-center text-danger"><?
                        if(
                            isset($result['table2']['men'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city = (int)$result['table2']['men'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman'][$numStr2[$i][2]]; echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center text-danger"><?
                        if(isset($result['table2']['men'][$numStr2[$i][2]]))
                        { echo $result['table2']['men'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center text-danger"><?
                        if(isset($result['table2']['woman'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman'][$numStr2[$i][2]];} else echo 0;?>
                    </td>

                    <!--Все (мальчики и девочки)-->
                    <td class="text-center"><?
                        if(
                            isset($result['table2']['ojir3']['2'][$numStr2[$i][2]]) ||
                            isset($result['table2']['ojir3']['5'][$numStr2[$i][2]]) ||
                            isset($result['table2']['ojir3']['10'][$numStr2[$i][2]]) ||
                            isset($result['table2']['ojir3']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['ojir3']['3'][$numStr2[$i][2]]) ||
                            isset($result['table2']['ojir3']['6'][$numStr2[$i][2]]) ||
                            isset($result['table2']['ojir3']['11'][$numStr2[$i][2]]) ||
                            isset($result['table2']['ojir3']['ini_v2'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table2']['ojir3']['2'][$numStr2[$i][2]] +
                                (int)$result['table2']['ojir3']['5'][$numStr2[$i][2]] +
                                (int)$result['table2']['ojir3']['10'][$numStr2[$i][2]] +
                                (int)$result['table2']['ojir3']['ini'][$numStr2[$i][2]] +
                                (int)$result['table2']['ojir3']['3'][$numStr2[$i][2]] +
                                (int)$result['table2']['ojir3']['6'][$numStr2[$i][2]] +
                                (int)$result['table2']['ojir3']['11'][$numStr2[$i][2]] +
                                (int)$result['table2']['ojir3']['ini_v2'][$numStr2[$i][2]]
                            ;
                            echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['ojir3']['2'][$numStr2[$i][2]]))
                        { echo $result['table2']['ojir3']['2'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['ojir3']['3'][$numStr2[$i][2]]))
                        { echo $result['table2']['ojir3']['3'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['ojir3']['5'][$numStr2[$i][2]]))
                        { echo $result['table2']['ojir3']['5'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['ojir3']['6'][$numStr2[$i][2]]))
                        { echo $result['table2']['ojir3']['6'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['ojir3']['10'][$numStr2[$i][2]]))
                        { echo $result['table2']['ojir3']['10'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['ojir3']['11'][$numStr2[$i][2]]))
                        { echo $result['table2']['ojir3']['11'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(
                            isset($result['table2']['ojir3']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['ojir3']['ini_v2'][$numStr2[$i][2]])
                        )
                        { echo ($result['table2']['ojir3']['ini_v2'][$numStr2[$i][2]] + $result['table2']['ojir3']['ini'][$numStr2[$i][2]]);
                        } else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(
                            isset($result['table2']['izbitok']['2'][$numStr2[$i][2]]) ||
                            isset($result['table2']['izbitok']['5'][$numStr2[$i][2]]) ||
                            isset($result['table2']['izbitok']['10'][$numStr2[$i][2]]) ||
                            isset($result['table2']['izbitok']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['izbitok']['3'][$numStr2[$i][2]]) ||
                            isset($result['table2']['izbitok']['6'][$numStr2[$i][2]]) ||
                            isset($result['table2']['izbitok']['11'][$numStr2[$i][2]]) ||
                            isset($result['table2']['izbitok']['ini_v2'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table2']['izbitok']['2'][$numStr2[$i][2]] +
                                (int)$result['table2']['izbitok']['5'][$numStr2[$i][2]] +
                                (int)$result['table2']['izbitok']['10'][$numStr2[$i][2]] +
                                (int)$result['table2']['izbitok']['ini'][$numStr2[$i][2]] +
                                (int)$result['table2']['izbitok']['3'][$numStr2[$i][2]] +
                                (int)$result['table2']['izbitok']['6'][$numStr2[$i][2]] +
                                (int)$result['table2']['izbitok']['11'][$numStr2[$i][2]] +
                                (int)$result['table2']['izbitok']['ini_v2'][$numStr2[$i][2]]
                            ; echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['izbitok']['2'][$numStr2[$i][2]]))
                        { echo $result['table2']['izbitok']['2'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['izbitok']['3'][$numStr2[$i][2]]))
                        { echo $result['table2']['izbitok']['3'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['izbitok']['5'][$numStr2[$i][2]]))
                        { echo $result['table2']['izbitok']['5'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['izbitok']['6'][$numStr2[$i][2]]))
                        { echo $result['table2']['izbitok']['6'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['izbitok']['10'][$numStr2[$i][2]]))
                        { echo $result['table2']['izbitok']['10'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['izbitok']['11'][$numStr2[$i][2]]))
                        { echo $result['table2']['izbitok']['11'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(
                            isset($result['table2']['izbitok']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['izbitok']['ini_v2'][$numStr2[$i][2]])
                        )
                        { echo ($result['table2']['izbitok']['ini_v2'][$numStr2[$i][2]] + $result['table2']['izbitok']['ini'][$numStr2[$i][2]]);
                        } else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(
                            isset($result['table2']['norm']['2'][$numStr2[$i][2]]) ||
                            isset($result['table2']['norm']['5'][$numStr2[$i][2]]) ||
                            isset($result['table2']['norm']['10'][$numStr2[$i][2]]) ||
                            isset($result['table2']['norm']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['norm']['3'][$numStr2[$i][2]]) ||
                            isset($result['table2']['norm']['6'][$numStr2[$i][2]]) ||
                            isset($result['table2']['norm']['11'][$numStr2[$i][2]]) ||
                            isset($result['table2']['norm']['ini_v2'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table2']['norm']['2'][$numStr2[$i][2]] +
                                (int)$result['table2']['norm']['5'][$numStr2[$i][2]] +
                                (int)$result['table2']['norm']['10'][$numStr2[$i][2]] +
                                (int)$result['table2']['norm']['ini'][$numStr2[$i][2]] +
                                (int)$result['table2']['norm']['3'][$numStr2[$i][2]] +
                                (int)$result['table2']['norm']['6'][$numStr2[$i][2]] +
                                (int)$result['table2']['norm']['11'][$numStr2[$i][2]] +
                                (int)$result['table2']['norm']['ini_v2'][$numStr2[$i][2]]
                            ; echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['norm']['2'][$numStr2[$i][2]]))
                        { echo $result['table2']['norm']['2'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['norm']['3'][$numStr2[$i][2]]))
                        { echo $result['table2']['norm']['3'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['norm']['5'][$numStr2[$i][2]]))
                        { echo $result['table2']['norm']['5'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['norm']['6'][$numStr2[$i][2]]))
                        { echo $result['table2']['norm']['6'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['norm']['10'][$numStr2[$i][2]]))
                        { echo $result['table2']['norm']['10'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['norm']['11'][$numStr2[$i][2]]))
                        { echo $result['table2']['norm']['11'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(
                            isset($result['table2']['norm']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['norm']['ini_v2'][$numStr2[$i][2]])
                        )
                        { echo ($result['table2']['norm']['ini_v2'][$numStr2[$i][2]] + $result['table2']['norm']['ini'][$numStr2[$i][2]]);
                        } else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(
                            isset($result['table2']['dif']['2'][$numStr2[$i][2]]) ||
                            isset($result['table2']['dif']['5'][$numStr2[$i][2]]) ||
                            isset($result['table2']['dif']['10'][$numStr2[$i][2]]) ||
                            isset($result['table2']['dif']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['dif']['3'][$numStr2[$i][2]]) ||
                            isset($result['table2']['dif']['6'][$numStr2[$i][2]]) ||
                            isset($result['table2']['dif']['11'][$numStr2[$i][2]]) ||
                            isset($result['table2']['dif']['ini_v2'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table2']['dif']['2'][$numStr2[$i][2]] +
                                (int)$result['table2']['dif']['5'][$numStr2[$i][2]] +
                                (int)$result['table2']['dif']['10'][$numStr2[$i][2]] +
                                (int)$result['table2']['dif']['ini'][$numStr2[$i][2]] +
                                (int)$result['table2']['dif']['3'][$numStr2[$i][2]] +
                                (int)$result['table2']['dif']['6'][$numStr2[$i][2]] +
                                (int)$result['table2']['dif']['11'][$numStr2[$i][2]] +
                                (int)$result['table2']['dif']['ini_v2'][$numStr2[$i][2]]
                            ; echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['dif']['2'][$numStr2[$i][2]]))
                        { echo $result['table2']['dif']['2'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['dif']['3'][$numStr2[$i][2]]))
                        { echo $result['table2']['dif']['3'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['dif']['5'][$numStr2[$i][2]]))
                        { echo $result['table2']['dif']['5'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['dif']['6'][$numStr2[$i][2]]))
                        { echo $result['table2']['dif']['6'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['dif']['10'][$numStr2[$i][2]]))
                        { echo $result['table2']['dif']['10'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(isset($result['table2']['dif']['11'][$numStr2[$i][2]]))
                        { echo $result['table2']['dif']['11'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center"><?
                        if(
                            isset($result['table2']['dif']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['dif']['ini_v2'][$numStr2[$i][2]])
                        )
                        { echo ($result['table2']['dif']['ini_v2'][$numStr2[$i][2]] + $result['table2']['dif']['ini'][$numStr2[$i][2]]);
                        } else echo 0;?>
                    </td>
                    <!--мальчики-->
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table2']['men']['ojir3']['2'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['ojir3']['5'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['ojir3']['10'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['ojir3']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['ojir3']['3'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['ojir3']['6'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['ojir3']['11'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['ojir3']['ini_v2'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table2']['men']['ojir3']['2'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['ojir3']['5'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['ojir3']['10'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['ojir3']['ini'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['ojir3']['3'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['ojir3']['6'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['ojir3']['11'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['ojir3']['ini_v2'][$numStr2[$i][2]]
                            ;
                            echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['ojir3']['2'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['ojir3']['2'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['ojir3']['3'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['ojir3']['3'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['ojir3']['5'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['ojir3']['5'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['ojir3']['6'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['ojir3']['6'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['ojir3']['10'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['ojir3']['10'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['ojir3']['11'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['ojir3']['11'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table2']['men']['ojir3']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['ojir3']['ini_v2'][$numStr2[$i][2]])
                        )
                        { echo ($result['table2']['men']['ojir3']['ini_v2'][$numStr2[$i][2]] + $result['table2']['men']['ojir3']['ini'][$numStr2[$i][2]]);
                        } else echo 0;?>
                    </td>

                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table2']['men']['izbitok']['2'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['izbitok']['5'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['izbitok']['10'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['izbitok']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['izbitok']['3'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['izbitok']['6'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['izbitok']['11'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['izbitok']['ini_v2'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table2']['men']['izbitok']['2'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['izbitok']['5'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['izbitok']['10'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['izbitok']['ini'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['izbitok']['3'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['izbitok']['6'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['izbitok']['11'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['izbitok']['ini_v2'][$numStr2[$i][2]]
                            ;
                            echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['izbitok']['2'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['izbitok']['2'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['izbitok']['3'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['izbitok']['3'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['izbitok']['5'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['izbitok']['5'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['izbitok']['6'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['izbitok']['6'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['izbitok']['10'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['izbitok']['10'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['izbitok']['11'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['izbitok']['11'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table2']['men']['izbitok']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['izbitok']['ini_v2'][$numStr2[$i][2]])
                        )
                        { echo ($result['table2']['men']['izbitok']['ini_v2'][$numStr2[$i][2]] + $result['table2']['men']['izbitok']['ini'][$numStr2[$i][2]]);
                        } else echo 0;?>
                    </td>

                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table2']['men']['norm']['2'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['norm']['5'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['norm']['10'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['norm']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['norm']['3'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['norm']['6'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['norm']['11'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['norm']['ini_v2'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table2']['men']['norm']['2'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['norm']['5'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['norm']['10'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['norm']['ini'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['norm']['3'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['norm']['6'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['norm']['11'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['norm']['ini_v2'][$numStr2[$i][2]]
                            ;
                            echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['norm']['2'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['norm']['2'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['norm']['3'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['norm']['3'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['norm']['5'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['norm']['5'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['norm']['6'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['norm']['6'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['norm']['10'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['norm']['10'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['norm']['11'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['norm']['11'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table2']['men']['norm']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['norm']['ini_v2'][$numStr2[$i][2]])
                        )
                        { echo ($result['table2']['men']['norm']['ini_v2'][$numStr2[$i][2]] + $result['table2']['men']['norm']['ini'][$numStr2[$i][2]]);
                        } else echo 0;?>
                    </td>

                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table2']['men']['dif']['2'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['dif']['5'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['dif']['10'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['dif']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['dif']['3'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['dif']['6'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['dif']['11'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['dif']['ini_v2'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table2']['men']['dif']['2'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['dif']['5'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['dif']['10'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['dif']['ini'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['dif']['3'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['dif']['6'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['dif']['11'][$numStr2[$i][2]] +
                                (int)$result['table2']['men']['dif']['ini_v2'][$numStr2[$i][2]]
                            ;
                            echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['dif']['2'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['dif']['2'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['dif']['3'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['dif']['3'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['dif']['5'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['dif']['5'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['dif']['6'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['dif']['6'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['dif']['10'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['dif']['10'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(isset($result['table2']['men']['dif']['11'][$numStr2[$i][2]]))
                        { echo $result['table2']['men']['dif']['11'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center bg-info"><?
                        if(
                            isset($result['table2']['men']['dif']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['men']['dif']['ini_v2'][$numStr2[$i][2]])
                        )
                        { echo ($result['table2']['men']['dif']['ini_v2'][$numStr2[$i][2]] + $result['table2']['men']['dif']['ini'][$numStr2[$i][2]]);
                        } else echo 0;?>
                    </td>

                    <!--девочки-->
                    <td class="text-center "><?
                        if(
                            isset($result['table2']['woman']['ojir3']['2'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['ojir3']['5'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['ojir3']['10'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['ojir3']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['ojir3']['3'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['ojir3']['6'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['ojir3']['11'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['ojir3']['ini_v2'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table2']['woman']['ojir3']['2'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['ojir3']['5'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['ojir3']['10'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['ojir3']['ini'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['ojir3']['3'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['ojir3']['6'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['ojir3']['11'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['ojir3']['ini_v2'][$numStr2[$i][2]]
                            ;
                            echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['ojir3']['2'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['ojir3']['2'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['ojir3']['3'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['ojir3']['3'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['ojir3']['5'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['ojir3']['5'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['ojir3']['6'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['ojir3']['6'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['ojir3']['10'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['ojir3']['10'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['ojir3']['11'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['ojir3']['11'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(
                            isset($result['table2']['woman']['ojir3']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['ojir3']['ini_v2'][$numStr2[$i][2]])
                        )
                        { echo ($result['table2']['woman']['ojir3']['ini_v2'][$numStr2[$i][2]] + $result['table2']['woman']['ojir3']['ini'][$numStr2[$i][2]]);
                        } else echo 0;?>
                    </td>

                    <td class="text-center "><?
                        if(
                            isset($result['table2']['woman']['izbitok']['2'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['izbitok']['5'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['izbitok']['10'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['izbitok']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['izbitok']['3'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['izbitok']['6'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['izbitok']['11'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['izbitok']['ini_v2'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table2']['woman']['izbitok']['2'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['izbitok']['5'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['izbitok']['10'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['izbitok']['ini'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['izbitok']['3'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['izbitok']['6'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['izbitok']['11'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['izbitok']['ini_v2'][$numStr2[$i][2]]
                            ;
                            echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['izbitok']['2'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['izbitok']['2'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['izbitok']['3'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['izbitok']['3'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['izbitok']['5'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['izbitok']['5'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['izbitok']['6'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['izbitok']['6'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['izbitok']['10'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['izbitok']['10'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['izbitok']['11'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['izbitok']['11'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(
                            isset($result['table2']['woman']['izbitok']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['izbitok']['ini_v2'][$numStr2[$i][2]])
                        )
                        { echo ($result['table2']['woman']['izbitok']['ini_v2'][$numStr2[$i][2]] + $result['table2']['woman']['izbitok']['ini'][$numStr2[$i][2]]);
                        } else echo 0;?>
                    </td>

                    <td class="text-center "><?
                        if(
                            isset($result['table2']['woman']['norm']['2'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['norm']['5'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['norm']['10'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['norm']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['norm']['3'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['norm']['6'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['norm']['11'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['norm']['ini_v2'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table2']['woman']['norm']['2'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['norm']['5'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['norm']['10'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['norm']['ini'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['norm']['3'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['norm']['6'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['norm']['11'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['norm']['ini_v2'][$numStr2[$i][2]]
                            ;
                            echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['norm']['2'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['norm']['2'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['norm']['3'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['norm']['3'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['norm']['5'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['norm']['5'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['norm']['6'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['norm']['6'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['norm']['10'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['norm']['10'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['norm']['11'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['norm']['11'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(
                            isset($result['table2']['woman']['norm']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['norm']['ini_v2'][$numStr2[$i][2]])
                        )
                        { echo ($result['table2']['woman']['norm']['ini_v2'][$numStr2[$i][2]] + $result['table2']['woman']['norm']['ini'][$numStr2[$i][2]]);
                        } else echo 0;?>
                    </td>

                    <td class="text-center "><?
                        if(
                            isset($result['table2']['woman']['dif']['2'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['dif']['5'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['dif']['10'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['dif']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['dif']['3'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['dif']['6'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['dif']['11'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['dif']['ini_v2'][$numStr2[$i][2]])
                        )
                        {
                            $sum_city =
                                (int)$result['table2']['woman']['dif']['2'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['dif']['5'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['dif']['10'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['dif']['ini'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['dif']['3'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['dif']['6'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['dif']['11'][$numStr2[$i][2]] +
                                (int)$result['table2']['woman']['dif']['ini_v2'][$numStr2[$i][2]]
                            ;
                            echo $sum_city;
                        } else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['dif']['2'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['dif']['2'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['dif']['3'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['dif']['3'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['dif']['5'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['dif']['5'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['dif']['6'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['dif']['6'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['dif']['10'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['dif']['10'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(isset($result['table2']['woman']['dif']['11'][$numStr2[$i][2]]))
                        { echo $result['table2']['woman']['dif']['11'][$numStr2[$i][2]];} else echo 0;?>
                    </td>
                    <td class="text-center "><?
                        if(
                            isset($result['table2']['woman']['dif']['ini'][$numStr2[$i][2]]) ||
                            isset($result['table2']['woman']['dif']['ini_v2'][$numStr2[$i][2]])
                        )
                        { echo ($result['table2']['woman']['dif']['ini_v2'][$numStr2[$i][2]] + $result['table2']['woman']['dif']['ini'][$numStr2[$i][2]]);
                        } else echo 0;?>
                    </td>
                </tr>
            <?}?>
        </table>
        <br>
        <br>
        <br>
    </div>
    <?
} ?>

<?
$script = <<< JS
    
    $("#pechat222").click(function () {
    var table = $('#tableId2');
        if (table && table.length) {
            var preserveColors = (table.hasClass('table2excel_with_colors') ? true : false);
            $(table).table2excel({
                exclude: ".noExl",
                name: "Excel Document Name",
                filename: "Выгрузка.xls",
                fileext: ".xls",
                exclude_img: true,
                exclude_links: true,
                exclude_inputs: true,
                preserveColors: preserveColors
            });
        }
    });                       
   
JS;
$this->registerJs($script, yii\web\View::POS_READY);
?>
